{
  "pageTitle": "Projects.",
  "projects": [
    {
      "title": "Furever Home",
      "description": "Full Stack Pet Adoption Site.",
      "descriptionExtended": "Furever Home is a collaborative project I worked on with a team of developers to create a platform that connects users with pets from verified breeders and shelters. Our goal was to make the adoption process seamless, secure, and personalized. The platform features a detailed matching system, verified sellers, and a secure adoption process to ensure a safe and satisfying experience for both pets and their future families.\n\nI contributed significantly to the frontend UI/UX design, backend user-generated content (e.g., pet listings and user logins), and the development of a robust matching algorithm to pair pets with potential adopters based on their preferences and lifestyle.",
      "videoId": "FureverHome",
      "technologies": ["Angular", "TypeScript", "MongoDB"],
      "github": "https://github.com/MaliceKy/FureverHome",
      "liveDemoLink": "https://fureverhome.kylemalice.info/",
      "hasDownload": false
    },
    {
      "title": "Parking Panic",
      "description": "Fast-paced, top-down pixel art web game.",
      "descriptionExtended": "Parking Panic is a web-based, top-down pixel art parking simulator developed collaboratively with a group of friends. The game is built entirely using JavaScript, HTML, and CSS. I was responsible for implementing the car's movement mechanics, collision detection, dynamic resizing of the game, and designing various assets such as obstacles and animations. The objective of the game is to navigate through an increasingly challenging map without losing all your lives by crashing into obstacles. Players progress through infinite rounds by dodging hazards and successfully parking in a randomized parking spot that glows on the map.\n\nThe game features two difficulty modes: Easy and Hard. In Easy mode, players have more lives, which reset each round, and face slower speeds with fewer obstacles. In contrast, Hard mode limits players to 3 lives that do not reset between rounds, along with higher speeds and a greater number of obstacles to avoid. The game tests players' reflexes and precision as they strive to reach higher rounds and perfect their parking skills.",
      "videoId": "ParkingPanic",
      "technologies": ["Javascript", "HTML", "CSS", "MongoDB"],
      "github": "https://github.com/amansjot/parking-panic",
      "liveDemoLink": "http://parkingpanic.kylemalice.info",
      "hasDownload": false
    },
    {
      "title": "VaultWise",
      "description": "Personal bankstatement tracker and AI assistant.",
      "descriptionExtended": "VaultWise is a personal bank statement tracker and emerging AI assistant. Built using React, JavaScript, and CSS, it delivers a seamless experience across devices. Users can securely sign in or explore as guests. Once in, VaultWise analyzes uploaded bank statements, summarizing income, expenses, and transactions. A dynamic graph displays monthly bank balance trends. Under development is an AI toolbox, leveraging GPT 3.5 Turbo, designed to guide users toward financial goals. Ultimately, VaultWise aims to make finance management simpler, insightful, and interactive. A fake bankstatement csv file is provided for the full VaultWise experience.",
      "videoId": "VaultWise",
      "technologies": ["React", "JavaScript", "CSS"],
      "github": "https://github.com/MaliceKy/VaultWise-Expense-AI-project",
      "liveDemoLink": "http://vaultwise.kylemalice.info/",
      "hasDownload": true,
      "downloadText": "Download CSV",
      "downloadLink": "/VaultWiseExampleCSV.csv"
    }
  ]
} 